  // ---------------------------------------------------------
  // プロローグ
  // ---------------------------------------------------------

 const prologueScenario = [

    {
      id: "p001",
      type: "dialogue",
      name: "    ",
      text: "ジ、ジジ......ジ....."
    },

    {
      id: "p002",
      type: "dialogue",
      name: "？？？",
      text: "おや......？"
    },

    {
      id: "p003",
      type: "dialogue",
      name: "？？？",
      text: "また新しい■■■でしょうか？"
    },

    {
      id: "p004",
      type: "dialogue",
      name: "？？？",
      text: "全く、断ったはずなのですが......まあ、来てしまったものは仕方がないですね。"
    },

    {
      id: "p005",
      type: "dialogue",
      name: "？？？",
      text: "やはり、まずは名前でしょうか？"
    },

    {
      id: "p006",
      type: "dialogue",
      name: "？？？",
      text: "そうですねえ、貴方の名前は――"
    }

  ];