// =========================================================
// 人物プロフィールデータ
// =========================================================

const CHARACTER_PROFILE_DATA = {

  protagonist: {
    name: "{NAME}",
    relation: "ユーザー",
    description:
      "本タブレットのユーザー。\n" +
      "現在は高校生として生活。\nまた、■■■■■■■■■■■■■■（管理者権限が不足しています。）"
  },

  kyoya: {
    name: "佐久間杏也",
    relation: "{NAME}の幼馴染",
    description:
      "2歳年上。\n" +
      "小さい頃から付き合いがあり、朝は主人公を迎えに来てくれる。\n優しく、頼りになる存在。"
  },

  kezi: {
    name: "白紬彗司",
    relation: "〇〇会社の技術開発責任者",
    description:
      "N歳年上。\n" +
      "技術開発の責任者として学校に駐在している。"
  },

  aoi: {
    name: "綾小路葵",
    relation: "理事長の息子",
    description:
      "N歳年上、大学生。\n" +
      "理事長の息子だからか、時々校内でも会える。"
  },

  shion: {
    name: "一ノ瀬紫苑",
    relation: "同級生",
    descriptions: {
    1: "{NAME}と口論になることが多い男子生徒。\n" +
      "挑発的な言動が目立つ。",
  
    2:"あ",

    3:"あ",

  }
 　 },

　anna: {
    name: "佐久間杏奈",
    relation: "同級生",
    descriptions:{
     1: "佐久間杏也の妹。\n" +
      "{NAME}を目の敵にしている。"

     2:"あ",

     3: "あ",
  },

  rento: {
    name: "柊蓮斗",
    relation: "同級生",
    description:
      "穏やかで周囲を気遣える男子生徒。\n" +
      "しっかり者で頼りになる。"
  }

};