// =========================================================
// 電子書籍・文書データ
// =========================================================

const EBOOK_DATA = {

  biology_1: {

    title: "歴史：近代化に伴う革命",
    pages: [
      `はじめに

18世紀後半から19世紀後半にかけ、世界では各地で革命が成立。
ヨーロッパを中心に広まった産業革命、市民革命は世界に大きな影響を与えた。

また、それらの革命に伴い世界的に近代化が進んだ。
多くの社会問題も発生する中、様々な新たな思想も現れた。それらは現代にも大きな影響を残している。

当時江戸時代にあった日本も近代化に迫られ、明治時代へと移り変わっていった。`,
    ]

  },

  biology_2: {
    title: "生物：遺伝子",
    pages: [

{

    text:`はじめに

遺伝情報は遺伝子によって親から子へ、子から孫へと受け継がれる。

遺伝子は細胞内の特定の部位に存在するDNAというものに含まれている。

DNAはいわゆる二重らせん構造になっており、複数のパーツによって構成されている。

DNAの情報を元に身体が構成されるため、個体差は遺伝子の違いによって生まれる。`,

    highlights: [
      {
        phrase: "親から子へ、子から孫へと受け継がれる。",
        title: "身体的特徴の遺伝",
        description: "父親と母親からそれぞれ遺伝情報を受け継ぐことで、子の身体的特徴（形質）が決定する。"+
"基本的に、親と子の形質はよく似ていることが多い。"
      }
    ]

}
　    ]
  },

  biology_3: {

    title: "数学：二次関数",
    pages: [
      `はじめに

二次関数とは、要するに　y=ax²＋bx＋c　で表せる式のことを指す。
二次関数には主に3つの形があり、それぞれ一般系、標準形、分解形と呼ばれる。

グラフに表した時、二次関数のグラフは左右対称のいわゆる放物線になる。
a<0のときの状態を上に凸、a>0の状態を下に凸と言う。

二次関数の一般系をグラフに表す際に、分かりやすくするために標準形にする計算を兵法完成と呼ぶ。`,
    ]

  },

  biology_4: {

    title: "国語：古文の文法",
    pages: [
      `はじめに

古文においても文法が存在し、動詞、形容詞、形容動詞や助動詞などは活用する。

動詞の活用は９種類あり、四段活用から始まり上一段活用、下一段活用が存在するのは現代とも共通している。
しかし、その3種類に加え古文では上二段活用、下二段活用と４種類の変格活用が存在する。

形容詞、形容動詞の活用は動詞の活用ほど多くは無く、それぞれ2種類ずつである。

助動詞の活用は数も非常に多く、それといった規則も無い。

その他、助詞や敬語など、活用以外の文法もある。`,
    ]

  },

  biology_5: {

    title: "英語：受動態",
    pages: [
      `はじめに

受動態とは、これまでの「AがBする」ではなく、「AがBされる」という受け身の状態の文章を指す。

受動態の文章の形は　be動詞＋過去分詞　である。
過去分詞とは、現在完了で使用した動詞の形を指す。
be動詞の形は主語によって変化させる。

さらに、　be動詞＋過去分詞＋byA　によって「Ａに～される」と表すこともできる。

また、受動態の文を　～された、と過去の形にしたいときにはbe動詞の部分を過去形にする。`,
    ]

  },


  schoolDocument: {
    title: "学内資料",
    pages: [
      `学内資料　1ページ

これは電子書籍機能のテスト用です。

教科書だけでなく、さまざまな文書を
登録できます。`,

      `学内資料　2ページ

別のページへ移動できるか
確認してください。`,
    ]

  },

  stampDocument: {
    title: "浅華町スタンプラリー",
    pages: [
      `スタンプラリー台紙

【スタンプ獲得状況】

①浅華中央公園
　未取得
②中央広場時計台
　未取得
③和菓子屋あさか（浅華商店街）
　未取得
④Asaka Cafe（浅華二番通り）
　未取得
⑤浅華丘陵展望台
　未取得

すべてのスタンプを集めましょう。`,
    ]

  }

};