// =========================================================
// 持ち物の基本情報
// =========================================================

const ITEM_DATA = {

  charm: {
    name: "お守り",
    description: "神社で名前を入れてもらったお守り。"
  },

  studentBook: {
    name: "学生手帳",
    description: "主人公の学生手帳。"
  }

};


// =========================================================
// 持ち物の初期所持状態
// =========================================================

const DEFAULT_INVENTORY = {

  charm: false,
  studentBook: false

};